In [1]:
import pandas as pd

Use Pandas read_html() function to retrive the HTML tables as dataframes from the web page: https://www.genealogybranches.com/censuscosts.html

Find out how many HTML tables Pandas retrieves from the web page. Find out which dataframe contain the data and use it for further processing

In [2]:
df = pd.read_html("https://www.genealogybranches.com/censuscosts.html")
len(df)

2

Display and explore the data (rows, columns, etc.) and determine the data quality (bad rows, bad columns, bad elements, null values, etc.)

In [3]:
df1 = df[0]
df1.head()

             0                 1            2                        3
0  Census Year  Total Population  Census Cost  Average Cost Per Person
1         1790           3929214      $44,377               1.13 cents
2         1800           5308483      $66,109               1.24 cents
3         1810           7239881     $178,445               2.46 cents
4         1820           9633822     $208,526               2.16 cents

In [4]:
df

[              0                 1               2                        3
 0   Census Year  Total Population     Census Cost  Average Cost Per Person
 1          1790           3929214         $44,377               1.13 cents
 2          1800           5308483         $66,109               1.24 cents
 3          1810           7239881        $178,445               2.46 cents
 4          1820           9633822        $208,526               2.16 cents
 5          1830          12866020        $378,545               2.94 cents
 6          1840          17069458        $833,371               4.88 cents
 7          1850          23191876      $1,423,351               6.14 cents
 8          1860          31443321      $1,969,377               6.26 cents
 9          1870          38558371      $3,421,198               8.87 cents
 10         1880          50155783      $5,790,678              11.54 cents
 11         1890          62979766     $11,547,127              18.33 cents
 12         1900          76303387     $11,854,000              15.54 cents
 13         1910          91972266     $15,968,000              17.07 cents
 14         1920         105710620     $25,117,000              23.76 cents
 15         1930         122775046     $40,156,000              32.71 cents
 16         1940         131669275     $67,527,000              51.29 cents
 17         1950         151325798     $91,462,000              60.44 cents
 18         1960         179323175    $127,934,000              71.34 cents
 19         1970         203302031    $247,653,000                    $1.22
 20         1980         226542199  $1,078,488,000                    $4.76
 21         1990         248718301  $2,492,830,000                   $10.02
 22         2000         281421906    $4.5 Billion                   $15.99
 23        2010*         308745538     $13 Billion                   $42.11,
                                                    0
 0  The U.S. population reached 300,000,000 on 17 ...]

In [5]:
df1.columns

Int64Index([0, 1, 2, 3], dtype='int64')

In [6]:
first_row = df1.iloc[0]
first_row

0                Census Year
1           Total Population
2                Census Cost
3    Average Cost Per Person
Name: 0, dtype: object

In [7]:
df1.columns = first_row
df1.head()

0  Census Year  Total Population  Census Cost  Average Cost Per Person
0  Census Year  Total Population  Census Cost  Average Cost Per Person
1         1790           3929214      $44,377               1.13 cents
2         1800           5308483      $66,109               1.24 cents
3         1810           7239881     $178,445               2.46 cents
4         1820           9633822     $208,526               2.16 cents

In [8]:
df1.head()

0  Census Year  Total Population  Census Cost  Average Cost Per Person
0  Census Year  Total Population  Census Cost  Average Cost Per Person
1         1790           3929214      $44,377               1.13 cents
2         1800           5308483      $66,109               1.24 cents
3         1810           7239881     $178,445               2.46 cents
4         1820           9633822     $208,526               2.16 cents

In [9]:
df1.drop([0], inplace=True)
df1.head()

0 Census Year Total Population Census Cost Average Cost Per Person
1        1790          3929214     $44,377              1.13 cents
2        1800          5308483     $66,109              1.24 cents
3        1810          7239881    $178,445              2.46 cents
4        1820          9633822    $208,526              2.16 cents
5        1830         12866020    $378,545              2.94 cents

Write a function named cleanse_year() that takes a string as input and removes any asterisks in the string and return the cleansed string. Test the function by using test strings (for example, "1989*", "20*10")

In [10]:
def cleanse_cost(raw_cost):
    cost = raw_cost.lstrip("$").replace(",","")
    if  raw_cost.find("4.5") != -1:          # if "4.5" in raw_cost:
        cost = "45" + "0" * 8
    elif raw_cost.find("Billion") != -1:     # elif "Billion" in raw_cost: 
        cost = "13" + "0" * 9
    return cost

Cleanse the column "Census Year" using the function cleanse_year() and Pandas's apply() function.

In [19]:
df1["new cost"] = df1["Census Cost"].apply(cleanse_cost)
df1.head()

0 Census Year Total Population Census Cost Average Cost Per Person new cost
1        1790          3929214     $44,377              1.13 cents    44377
2        1800          5308483     $66,109              1.24 cents    66109
3        1810          7239881    $178,445              2.46 cents   178445
4        1820          9633822    $208,526              2.16 cents   208526
5        1830         12866020    $378,545              2.94 cents   378545

In [21]:
df1.columns

Index(['Census Year', 'Total Population', 'Census Cost',
       'Average Cost Per Person', 'new cost'],
      dtype='object', name=0)

Repeat this process for column "Total Population", "Census Cost", "Average Cost Per Person". (define, test, and apply the function)

In [22]:
df1["new population"] = df1["Total Population"].apply(cleanse_cost)
df1.head()

,Census Year,Total Population,Census Cost,Average Cost Per Person,new cost,new population
1,1790,3929214,"$44,377",1.13 cents,44377,3929214
2,1800,5308483,"$66,109",1.24 cents,66109,5308483
3,1810,7239881,"$178,445",2.46 cents,178445,7239881
4,1820,9633822,"$208,526",2.16 cents,208526,9633822
5,1830,12866020,"$378,545",2.94 cents,378545,12866020

In [23]:
df1["new cost per person"] = df1["Average Cost Per Person"].apply(cleanse_cost)
df1.head()

,Census Year,Total Population,Census Cost,Average Cost Per Person,new cost,new population,new cost per person
1,1790,3929214,"$44,377",1.13 cents,44377,3929214,1.13 cents
2,1800,5308483,"$66,109",1.24 cents,66109,5308483,1.24 cents
3,1810,7239881,"$178,445",2.46 cents,178445,7239881,2.46 cents
4,1820,9633822,"$208,526",2.16 cents,208526,9633822,2.16 cents
5,1830,12866020,"$378,545",2.94 cents,378545,12866020,2.94 cents

In [24]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 23 entries, 1 to 23
Data columns (total 7 columns):
Census Year                23 non-null object
Total Population           23 non-null object
Census Cost                23 non-null object
Average Cost Per Person    23 non-null object
new cost                   23 non-null object
new population             23 non-null object
new cost per person        23 non-null object
dtypes: object(7)
memory usage: 1.4+ KB

In [26]:
df1.describe()

,Census Year,Total Population,Census Cost,Average Cost Per Person,new cost,new population,new cost per person
count,23,23,23,23,23,23,23
unique,23,23,23,23,23,23,23
top,1930,122775046,"$44,377",$4.76,1078488000,122775046,15.54 cents
freq,1,1,1,1,1,1,1

In [36]:
df2= df1[['new cost','new population', 'new cost per person']]

In [37]:
df2

0      new cost new population new cost per person
1         44377        3929214          1.13 cents
2         66109        5308483          1.24 cents
3        178445        7239881          2.46 cents
4        208526        9633822          2.16 cents
5        378545       12866020          2.94 cents
6        833371       17069458          4.88 cents
7       1423351       23191876          6.14 cents
8       1969377       31443321          6.26 cents
9       3421198       38558371          8.87 cents
10      5790678       50155783         11.54 cents
11     11547127       62979766         18.33 cents
12     11854000       76303387         15.54 cents
13     15968000       91972266         17.07 cents
14     25117000      105710620         23.76 cents
15     40156000      122775046         32.71 cents
16     67527000      131669275         51.29 cents
17     91462000      151325798         60.44 cents
18    127934000      179323175         71.34 cents
19    247653000      203302031                1.22
20   1078488000      226542199                4.76
21   2492830000      248718301               10.02
22   4500000000      281421906               15.99
23  13000000000      308745538               42.11

After all columns are cleansed, save the clenased dataframe to a file named "census_cost_cleansed.csv" using CSV format.

In [28]:
import csv
with open('census_cost.csv', 'r', newline='') as f:
    fieldnames = ['year_list','pop_list','cost_list','avg_list']
    thewriter = csv.DictWriter(f, fieldnames= fieldnames)

In [29]:
print(thewriter)

<csv.DictWriter object at 0x0000010D422E9940>

In [45]:
df2.to_csv(r'C:\Users\Sunny\Desktop\data 690/census_cost_cleansed.csv', index = False)

In [47]:
df3=pd.read_csv("census_cost_cleansed.csv")

In [48]:
df3.head()

   new cost  new population new cost per person
0     44377         3929214          1.13 cents
1     66109         5308483          1.24 cents
2    178445         7239881          2.46 cents
3    208526         9633822          2.16 cents
4    378545        12866020          2.94 cents

In [49]:
df3.tail()

       new cost  new population new cost per person
18    247653000       203302031                1.22
19   1078488000       226542199                4.76
20   2492830000       248718301               10.02
21   4500000000       281421906               15.99
22  13000000000       308745538               42.11